silk-indus/esp32Radio_V2/include/SDcard.h
// SDcard.h
// Includes for SD card interface.
// The tracklist will be written to a file on the SD card itself.
//
#if ESP_ARDUINO_VERSION_MAJOR < 2                     // File function "path()" not available in older versions
  #define path() name()                               // Use "name()" instead
#endif
#define MAXFNLEN    255                               // Max length of a full filespec
#define SD_MAXDEPTH 8                                 // Maximum MP3 folder nesting depth

struct mp3spec_t                                      // For List of mp3 file on SD card
{
  uint8_t entrylen ;                                  // Total length of this entry
  uint8_t prevlen ;                                   // Number of chars that are equal to previous
  char    filespec[MAXFNLEN] ;                        // Full file spec, the divergent end part
} ;


#ifndef SDCARD
  #define mount_SDCARD()         false                   // Dummy mount
  #define scan_SDCARD()                                  // Dummy scan files
  //#define check_SDCARD()                               // Dummy check
  #define close_SDCARD()                                 // Dummy close
  #define read_SDCARD(a,b)       0                       // Dummy read file buffer
  #define selectnextSDnode(b)    String("")
  #define getSDfilename(a)       String("")
  #define listsdtracks(a,b,c)    0
  #define connecttofile_SD()      false                  // Dummy connect to file
  #define initSDTask()                                   // Dummy start of task

#else
  #include <SPI.h>
  #include <SD.h>
  #include <FS.h>
  #include <strings.h>                                  // strcasecmp for .mp3/.MP3 variants
  #define SDSPEED   2000000                             // SPI speed of SD card
  #define TRACKLIST "/tracklist.dat"                    // File with tracklist on SD card

  bool            SD_okay = false ;                     // SD is okay
  bool            SD_mounted = false ;                  // SD is mounted
  int             SD_filecount = 0 ;                    // Number of filenames in SD_nodelist
  int             SD_curindex ;                         // Current index in mp3names
  RTC_NOINIT_ATTR mp3spec_t   mp3entry ;                // Entry with track spec
  RTC_NOINIT_ATTR char        SD_lastmp3spec[512] ;     // Previous full file spec
  File            mp3file ;                             // File containing mp3 on SD card
  int             mp3filelength = 0 ;                   // Length of file
  uint32_t        SD_totalbytes = 0 ;                   // Audio bytes at start of current track
  uint16_t        SD_bitrate = 0 ;                      // Bitrate detected from first MP3 frame
  uint32_t        SD_duration = 0 ;                     // Exact VBR duration, if present
  uint32_t        SD_audio_start = 0 ;                  // Absolute offset of the first MP3 frame
  uint32_t        SD_cover_offset = 0 ;                 // Absolute offset of embedded JPEG cover
  uint32_t        SD_cover_length = 0 ;                 // Length of embedded JPEG cover
  int16_t         SD_seek_seconds = 0 ;                 // Pending relative seek request
  bool            SD_playing = false ;                  // Local track playback is active
  bool            SD_cover_visible = false ;            // Cover currently occupies the TFT
  bool            randomplay = false ;                  // Switch for random play
  volatile bool   SD_mount_requested = false ;          // User requested one explicit media check
  volatile bool   SD_media_check_complete = false ;     // Main task may open the MP3 browser
  volatile bool   SD_open_menu_requested = false ;      // Open browser after the check/scan
  File            trackfile ;                           // File for tracknames
  bool            trackfile_isopen = false ;            // True if trackfile is open for read
  
  // Forward declaration
  void setdatamode ( datamode_t newmode ) ;
  void SDtask      ( void * parameter ) ;

  const char*      STAG = "SDcard" ;


  //**************************************************************************************************
  //                               C L O S E T R A C K F I L E                                       *
  //**************************************************************************************************
  void closeTrackfile()
  {
    if ( trackfile_isopen )                             // Trackfile still open?
    {
      trackfile.close() ;
    }
    trackfile_isopen = false ;                          // Reset open status
  }


  //**************************************************************************************************
  //                                  O P E N T R A C K F I L E                                       *
  //**************************************************************************************************
  bool openTrackfile ( const char* mode = FILE_READ )
  {
    closeTrackfile() ;                                  // Close if already open
    trackfile = SD.open ( TRACKLIST, mode ) ;           // Open the tracklist file on SD card
    ESP_LOGI ( STAG, "OpenTrackfile(%s) result is %d",
               mode, (int)trackfile ) ;
    trackfile_isopen = ( trackfile != 0 ) ;             // Check result
    return trackfile_isopen ;                           // Return open status
  }


  //**************************************************************************************************
  //                               G E T F I R S T S D F I L E N A M E                               *
  //**************************************************************************************************
  // Get the first filespec from track file on SD card.                                              *
  //**************************************************************************************************
  const char* getFirstSDFileName()
  {
    if ( ! openTrackfile() )                            // Try to open track file
    {
      return NULL ;                                     // File not available
    }
    if ( trackfile.available() < 3 )                    // No complete entry available?
    {
      closeTrackfile() ;
      SD_filecount = 0 ;
      return NULL ;
    }
    uint8_t* p = (uint8_t*)&mp3entry ;                  // Point to entrylength of mp3entry
    trackfile.read ( p, sizeof(mp3entry.entrylen) ) ;   // Get total size of entry
    p += sizeof(mp3entry.entrylen) ;                    // Bump pointer
    trackfile.read ( p, mp3entry.entrylen -             // Read rest of entry
                        sizeof(mp3entry.entrylen) ) ;
    strcpy ( SD_lastmp3spec, mp3entry.filespec ) ;      // Copy filename into SD_last
    SD_curindex = 0 ;                                   // Set current index to 0
    return SD_lastmp3spec ;                             // Return pointer to filename
  }


  //**************************************************************************************************
  //                                   S E T S D F I L E N A M E                                     *
  //**************************************************************************************************
  // Set the current filespec.                                                                       *
  //**************************************************************************************************
  void setSDFileName ( const char* fnam )
  {
    if ( strlen ( fnam ) < MAXFNLEN )                   // Guard against long filenames
    {
      strcpy ( SD_lastmp3spec,  fnam ) ;                // Copy filename into SD_last
    }
  }


  //**************************************************************************************************
  //                                   G E T S D F I L E N A M E                                     *
  //**************************************************************************************************
  // Get a filespec from tracklist file at index.                                                    *
  // If index is negative, a random track is selected.                                               *
  //**************************************************************************************************
  char* getSDFileName ( int inx )
  {
    if ( ! trackfile_isopen )                             // Track file available?
    {
      return NULL ;                                       // No, return empty name
    }
    if ( inx < 0 )                                        // Negative track number?
    {
      inx = (int) random ( SD_filecount ) ;               // Yes, pick random track
      randomplay = true ;                                 // Set random play flag
    }
    else
    {
      randomplay = false ;                                // Not random, reset flag
    }
    if ( inx >= SD_filecount )                            // Protect against going beyond last track
    {
      inx = 0 ;                                           // Beyond last track: rewind to begin
    }
    if ( inx < SD_curindex )                              // Going backwards?
    {
      getFirstSDFileName() ;                              // Yes, start all over
    }
    while ( SD_curindex < inx )                           // Move forward until at required position
    {
      uint8_t* pm = (uint8_t*)&mp3entry ;                 // Point to entrylen of mp3entry
      trackfile.read ( pm, sizeof(mp3entry.entrylen) ) ;  // Get total size of entry
      pm += sizeof(mp3entry.entrylen) ;                   // Bump pointer
      trackfile.read ( pm, mp3entry.entrylen -            // Read rest of entry
                         sizeof ( mp3entry.entrylen ) ) ;
      strcpy ( SD_lastmp3spec + mp3entry.prevlen,         // Copy filename into SD_last
               mp3entry.filespec ) ;
      SD_curindex++ ;                                     // Set current index
    }
    return SD_lastmp3spec ;                               // Return pointer to filename
  }


  //**************************************************************************************************
  //                               G E T N E X T S D F I L E N A M E                                 *
  //**************************************************************************************************
  // Get next filespec from mp3names.                                                                *
  //**************************************************************************************************
  char* getNextSDFileName()
  {
    int inx = SD_curindex + 1 ;                          // By default next track

    if ( randomplay )                                    // Playing random tracks?
    {
      inx = -1 ;                                         // Yes, next track will be random too
    }
    return ( getSDFileName ( inx ) ) ;                   // Select the track
  }


  //**************************************************************************************************
  //                           G E T C U R R E N T S D F I L E N A M E                               *
  //**************************************************************************************************
  // Get current filespec from mp3names.                                                             *
  //**************************************************************************************************
  char* getCurrentSDFileName()
  {
    return SD_lastmp3spec ;                             // Return pointer to filename
  }


  //**************************************************************************************************
  //                      G E T C U R R E N T S H O R T S D F I L E N A M E                          *
  //**************************************************************************************************
  // Get last part of current filespec from mp3names.                                                *
  //**************************************************************************************************
  char* getCurrentShortSDFileName()
  {
    return strrchr ( SD_lastmp3spec, '/' ) + 1 ;        // Last part of filespec
  }


  //**************************************************************************************************
  //                                  A D D T O F I L E L I S T                                      *
  //**************************************************************************************************
  // Add a filename to the trackfile on SD card.                                                     *
  // Example:                                                                                        *
  // Entry entry prev   filespec                             Interpreted result                      *
  //  num   len   len                   
  // ----- ----- ----   --------------------------------     ------------------------------------    *
  // [0]      32    0   /Fleetwood Mac/Albatross.mp3         /Fleetwood Mac/Albatross.mp3            *
  // [1]      15   15   Hold Me.mp3                          /Fleetwood Mac/Hold Me.mp3              *
  //**************************************************************************************************
  bool addToFileList ( const char* newfnam )
  {
    char*             lnam = SD_lastmp3spec ;           // Set pointer to compare
    uint8_t           n = 0 ;                           // Counter for number of equal characters
    uint16_t          l = strlen ( newfnam ) ;          // Length of new file name
    uint8_t           entrylen ;                        // Length of entry
    bool              res = false ;                     // Function result

    //ESP_LOGI ( STAG, "Full filename is %s", newfnam ) ;
    if ( l >= ( sizeof ( SD_lastmp3spec ) - 1 ) )       // Block very long filenames
    {
      ESP_LOGE ( STAG, "SD filename too long (%d)!", l ) ;
      return false ;                                    // Filename too long: skip
    }
    while ( *lnam == *newfnam )                         // Compare next character of filename
    {
      if ( *lnam == '\0' )                              // End of name?
      {
        break ;                                         // Yes, stop
      }
      n++ ;                                             // Equal: count
      lnam++ ;                                          // Update pointers
      newfnam++ ;
    }
    mp3entry.prevlen = n ;                              // This part is equal to previous name
    l -= n ;                                            // Length of rest of filename
    if ( l >= ( sizeof ( mp3spec_t ) - 5 ) )            // Block very long filenames
    {
      ESP_LOGE ( STAG, "SD filename too long (%d)!", l ) ;
      return false ;                                    // Filename too long: skip
    }
    strcpy ( mp3entry.filespec, newfnam ) ;             // This is last part of new filename
    entrylen = sizeof(mp3entry.entrylen) +              // Size of entry including string delimeter
               sizeof(mp3entry.prevlen) +
               strlen (newfnam) + 1 ;
    mp3entry.entrylen = entrylen ;
    strcpy ( lnam, newfnam ) ;                          // Set a new lastmp3spec
    ESP_LOGI ( STAG, "Added %3u : %s", n,               // Show last part of filename
               getCurrentShortSDFileName() ) ;
    if ( trackfile )                                    // Outputfile open?
    {
      res = true ;                                      // Yes, positive result
      trackfile.write ( (uint8_t*)&mp3entry,            // Yes, add to list
                         entrylen ) ; 
      SD_filecount++ ;                                  // Count number of files in list
    }
    return res ;                                        // Return result of adding name
  }


  //**************************************************************************************************
  //                                      G E T S D T R A C K S                                      *
  //**************************************************************************************************
  // Search all MP3 files on directory of SD card.                                                   *
  // Will be called recursively.                                                                     *
  //**************************************************************************************************
  bool getsdtracks ( const char * dirname, uint8_t levels )
  {
    File       root ;                                     // Work directory
    File       file ;                                     // File in work directory

    //ESP_LOGI ( STAG, "getsdt dir is %s", dirname ) ;
    root = SD.open ( dirname ) ;                          // Open directory
    if ( !root )                                          // Check on open
    {
      ESP_LOGI ( STAG, "Failed to open directory" ) ;
      return false ;
    }
    if ( !root.isDirectory() )                            // Really a directory?
    {
      ESP_LOGI ( STAG, "Not a directory" ) ;
      return false ;
    }
    file = root.openNextFile() ;
    while ( file )
    {
      vTaskDelay ( 1 ) ;                                  // Yield without slowing large folder scans
      if ( file.isDirectory() )                           // Is it a directory?
      {
        String childPath = String ( file.path() ) ;        // Keep path after closing child handle
        file.close() ;                                     // Limit simultaneous handles while recursing
        if ( levels )                                     // Dig in subdirectory?
        {
          const char* basename = strrchr ( childPath.c_str(), '/' ) ;
          if ( basename && basename[1] != '.' )            // Skip hidden directories
          {
            if ( ! getsdtracks ( childPath.c_str(),       // Non hidden directory: call recursive
                                  levels -1 ) )
            {
              return false ;                              // File I/O error
            }
          }
        }
      }
      else                                                // It is a file
      {
        const char* ext = file.name() ;                   // Point to begin of name
        size_t namelen = strlen ( ext ) ;
        ext = namelen >= 4 ? ext + namelen - 4 : ext ;    // Point safely to extension
        if ( namelen >= 4 && strcasecmp ( ext, ".mp3" ) == 0 )
        {
          if ( ! addToFileList ( file.path() ) )          // Add file to the list
          {
            file.close() ;
            break ;                                       // No need to continue
          }
        }
        file.close() ;                                     // Release before opening the next entry
      }
      file = root.openNextFile() ;
    }
    return true ;
  }


  // Return MPEG Layer III bitrate in kbps from the first valid frame header.
  static uint16_t detectSDMP3Bitrate ( const uint8_t* data, size_t len )
  {
    static const uint16_t brMpeg1Layer3[16] =
      { 0, 32, 40, 48, 56, 64, 80, 96, 112, 128, 160, 192, 224, 256, 320, 0 } ;
    static const uint16_t brMpeg2Layer3[16] =
      { 0, 8, 16, 24, 32, 40, 48, 56, 64, 80, 96, 112, 128, 144, 160, 0 } ;
    for ( size_t i = 0 ; i + 3 < len ; i++ )
    {
      if ( data[i] != 0xFF || ( data[i + 1] & 0xE0 ) != 0xE0 ) continue ;
      uint8_t version = ( data[i + 1] >> 3 ) & 0x03 ;
      uint8_t layer = ( data[i + 1] >> 1 ) & 0x03 ;
      uint8_t brIndex = ( data[i + 2] >> 4 ) & 0x0F ;
      uint8_t sampleIndex = ( data[i + 2] >> 2 ) & 0x03 ;
      if ( version == 1 || layer != 1 || brIndex == 0 || brIndex == 15 ||
           sampleIndex == 3 ) continue ;
      return version == 3 ? brMpeg1Layer3[brIndex] : brMpeg2Layer3[brIndex] ;
    }
    return 0 ;
  }


  // Return exact duration from Xing/Info or VBRI, otherwise zero for bitrate-based fallback.
  static uint32_t detectSDMP3Duration ( const uint8_t* data, size_t len )
  {
    static const uint32_t sampleRates[3] = { 44100, 48000, 32000 } ;
    for ( size_t i = 0 ; i + 40 < len ; i++ )
    {
      if ( data[i] != 0xFF || ( data[i + 1] & 0xE0 ) != 0xE0 ) continue ;
      uint8_t version = ( data[i + 1] >> 3 ) & 0x03 ;
      uint8_t layer = ( data[i + 1] >> 1 ) & 0x03 ;
      uint8_t sampleIndex = ( data[i + 2] >> 2 ) & 0x03 ;
      if ( version == 1 || layer != 1 || sampleIndex == 3 ) continue ;
      uint32_t sampleRate = sampleRates[sampleIndex] ;
      if ( version == 2 ) sampleRate /= 2 ;
      else if ( version == 0 ) sampleRate /= 4 ;
      bool mono = ( ( data[i + 3] >> 6 ) & 0x03 ) == 3 ;
      size_t sideInfo = version == 3 ? ( mono ? 17 : 32 ) : ( mono ? 9 : 17 ) ;
      size_t xing = i + 4 + sideInfo ;
      if ( xing + 12 <= len &&
           ( !memcmp ( data + xing, "Xing", 4 ) || !memcmp ( data + xing, "Info", 4 ) ) )
      {
        uint32_t flags = ( uint32_t ( data[xing + 4] ) << 24 ) |
                         ( uint32_t ( data[xing + 5] ) << 16 ) |
                         ( uint32_t ( data[xing + 6] ) << 8 ) |
                           uint32_t ( data[xing + 7] ) ;
        if ( flags & 1 )
        {
          uint32_t frames = ( uint32_t ( data[xing + 8] ) << 24 ) |
                            ( uint32_t ( data[xing + 9] ) << 16 ) |
                            ( uint32_t ( data[xing + 10] ) << 8 ) |
                              uint32_t ( data[xing + 11] ) ;
          uint32_t samplesPerFrame = version == 3 ? 1152 : 576 ;
          if ( frames && sampleRate )
          {
            return ( frames * (uint64_t)samplesPerFrame + sampleRate / 2 ) / sampleRate ;
          }
        }
      }
      size_t vbri = i + 4 + 32 ;
      if ( vbri + 18 <= len && !memcmp ( data + vbri, "VBRI", 4 ) )
      {
        uint32_t frames = ( uint32_t ( data[vbri + 14] ) << 24 ) |
                          ( uint32_t ( data[vbri + 15] ) << 16 ) |
                          ( uint32_t ( data[vbri + 16] ) << 8 ) |
                            uint32_t ( data[vbri + 17] ) ;
        uint32_t samplesPerFrame = version == 3 ? 1152 : 576 ;
        if ( frames && sampleRate )
        {
          return ( frames * (uint64_t)samplesPerFrame + sampleRate / 2 ) / sampleRate ;
        }
      }
      return 0 ;                                         // First valid audio frame checked
    }
    return 0 ;
  }


  void getSDProgress ( uint32_t& playedSeconds, uint32_t& lengthSeconds,
                       uint8_t& percent )
  {
    playedSeconds = 0 ;
    lengthSeconds = 0 ;
    percent = 0 ;
    if ( !SD_playing || !SD_totalbytes ) return ;
    uint32_t left = mp3filelength > (int)SD_totalbytes ? SD_totalbytes : mp3filelength ;
    uint32_t playedBytes = SD_totalbytes - left ;
    uint64_t percentage = ( playedBytes * 100ULL ) / SD_totalbytes ;
    percent = percentage > 100 ? 100 : (uint8_t)percentage ;
    if ( SD_duration )
    {
      lengthSeconds = SD_duration ;
      playedSeconds = ( playedBytes * (uint64_t)SD_duration ) / SD_totalbytes ;
    }
    else if ( SD_bitrate )
    {
      playedSeconds = ( playedBytes * 8ULL ) / ( (uint32_t)SD_bitrate * 1000ULL ) ;
      lengthSeconds = ( SD_totalbytes * 8ULL ) / ( (uint32_t)SD_bitrate * 1000ULL ) ;
    }
  }


  String getSDProgressText()
  {
    uint32_t playedSeconds, lengthSeconds ;
    uint8_t percent ;
    char text[28] ;
    getSDProgress ( playedSeconds, lengthSeconds, percent ) ;
    snprintf ( text, sizeof(text), "%lu:%02lu/%lu:%02lu",
               (unsigned long)( playedSeconds / 60 ),
               (unsigned long)( playedSeconds % 60 ),
               (unsigned long)( lengthSeconds / 60 ),
               (unsigned long)( lengthSeconds % 60 ) ) ;
    return String ( text ) ;
  }


