silk-indus/esp32Radio_V2/include/SDcard.h
    if ( !forceMount && ( newmillis = millis() ) < nextCheckTime ) // Time to check?
    {
      return false ;                                        // No, return "no new insert"
    }
    if ( forceMount ) newmillis = millis() ;
    nextCheckTime = newmillis + 5000 ;                      // Yes, set new check time
    if ( dpin >= 0 )                                        // Hardware detection possible?
    {
      sdinsNew = ( digitalRead ( dpin ) == LOW ) ;          // Yes, see if card inserted
      if ( sdinsNew == sdInserted )                         // Situation changed?
      {
        return false ;                                      // No, return "no new insert"
      }
      else
      {
        sdInserted = sdinsNew ;                             // Remember status
        if ( ! sdInserted )                                 // Card out?
        {
          SDCardRemoved() ;                                 // Stop playback and unmount it
        }
        else                                                // Card inserted
        {
          ESP_LOGI ( STAG, "SD card inserted" ) ;
          SD_okay = mount_SDCARD ( ini_block.sd_cs_pin ) ;  // Try to mount
          if ( !SD_okay ) sdInserted = false ;              // Retry while detect remains LOW
        }
      }
    }
    else                                                    // Handle SD without detect pin
    {
      if ( SD_mounted && SD_okay )                          // Card was available last time?
      {
        if ( !forceMount && !SD_playing )                   // Radio/idle mode must not touch SPI
        {
          return false ;                                    // Check again only on explicit MP3-menu request
        }
        File probe = SD.open ( TRACKLIST, FILE_READ ) ;     // One lightweight physical access
        bool probeOkay = probe &&                          // Force one real data read if non-empty
                           ( probe.size() == 0 || probe.read() >= 0 ) ;
        if ( probeOkay )
        {
          probe.close() ;
          probeFailures = 0 ;                              // Healthy: no folder scan is performed
          return false ;                                   // Not a newly inserted card
        }
        if ( !forceMount && ++probeFailures < 2 )          // Avoid a transient error while SD plays
        {
          ESP_LOGW ( STAG, "SD presence check failed, will retry" ) ;
          return false ;
        }
        probeFailures = 0 ;
        SDCardRemoved() ;                                  // Release stale filesystem state
        if ( !forceMount ) return false ;                  // Never auto-mount after removal
      }
      if ( !forceMount ) return false ;                    // No repeated SD.begin() without detect pin
      ESP_LOGI ( STAG, "Try to mount SD card" ) ;
      SD_okay = mount_SDCARD ( ini_block.sd_cs_pin ) ;      // Try to mount
      if ( SD_okay )
      {
        sdInserted = true ;
        probeFailures = 0 ;
        ESP_LOGI ( STAG, "SD card inserted (polling mode)" ) ;
      }
    }
    return SD_okay ;                                        // Return result
  }


  //**************************************************************************************************
  //                                    C O U N T F I L E S                                          *
  //**************************************************************************************************
  // Count number of tracks in the track list.                                                       *
  //**************************************************************************************************
  int countfiles()
  {
    int count = 0 ;                                         // Files found
  
    while ( trackfile.available() > 1 )
    {
      uint8_t* pm = (uint8_t*)&mp3entry ;                   // Point to entrylength of mp3entry
      trackfile.read ( pm, sizeof(mp3entry.entrylen) ) ;    // Get total size of entry
      pm += sizeof(mp3entry.entrylen) ;                     // Bump pointer
      trackfile.read ( pm, mp3entry.entrylen -              // Read rest of entry
                        sizeof ( mp3entry.entrylen ) ) ;
      count++ ;                                             // count entries
      vTaskDelay ( 10 / portTICK_PERIOD_MS  ) ;             // Allow other tasks
    }
    ESP_LOGI ( STAG, "%d files on SD card", count ) ;
    return count ;                                          // Return number of tracks
  }


  //**************************************************************************************************
  //                                       S D T A S K                                               *
  //**************************************************************************************************
  // This task will constantly try to fill the ringbuffer with filenames on SD.                      *
  // With no detect pin, mount once at boot and thereafter only when the MP3 menu requests it.        *
  // While an SD track plays, a lightweight presence check can still stop it after removal.          *
  //**************************************************************************************************
  void SDtask ( void * parameter )
  {
    const char* ffn ;                                     // First filename on SD card
    bool firstCheck = true ;                              // One automatic mount attempt at boot

    vTaskDelay ( 1000 / portTICK_PERIOD_MS ) ;            // Start delay
    while ( true )                                        // Endless task
    {
      vTaskDelay ( 200 / portTICK_PERIOD_MS ) ;           // Allow other tasks
      bool userCheck = SD_mount_requested ;
      if ( userCheck )
      {
        SD_mount_requested = false ;                      // Consume exactly one explicit request
        SD_media_check_complete = false ;
      }
      bool newCard = SDInsertCheck ( firstCheck || userCheck ) ;
      firstCheck = false ;
      if ( newCard )                                      // See if new card is inserted
      {
        SD_lastmp3spec[0] = '\0' ;                        // No last track
        SD_filecount = 0 ;
        closeTrackfile() ;
        if ( SD.exists ( TRACKLIST ) && !SD.remove ( TRACKLIST ) )
        {
          ESP_LOGE ( STAG, "Cannot replace stale %s", TRACKLIST ) ;
          SD_okay = false ;
        }
        else
        {
          ESP_LOGI ( STAG, "Scan MP3 folders and rebuild %s", TRACKLIST ) ;
          if ( openTrackfile ( FILE_WRITE ) )             // Try to open trackfile for write
          {
            SD_okay = getsdtracks ( "/", SD_MAXDEPTH ) ;  // Get filenames, store on the SD card
            closeTrackfile() ;                            // Close the tracklist file
          }
          else
          {
            SD_okay = false ;
          }
        }
        ESP_LOGI ( STAG, "%d tracks in folders on SD card", SD_filecount ) ;
        ffn = getFirstSDFileName() ;
        if ( ffn )
        {
          ESP_LOGI ( STAG, "First file on SD card is %s", // Show the first track name
                     ffn ) ;
        }
      }
      if ( userCheck ) SD_media_check_complete = true ;   // Scanning, if needed, is now finished
    }
  }
#endif
